Before you turn this problem in, make sure everything runs as expected. First, **restart the kernel** (in the menubar, select Kernel$\rightarrow$Restart) and then **run all cells** (in the menubar, select Cell$\rightarrow$Run All).

Make sure you fill in any place that says `YOUR CODE HERE` or "YOUR ANSWER HERE", as well as your name and collaborators below:

In [ ]:
NAME = "Ziyue Yin"
COLLABORATORS = ""

---

Quiz 11, STATS102 Fall 2022 Session 1, Duke Kunshan University, Sep 13th beijing time
![](dku.jpg)
For this problem set, we'll be using the Jupyter notebook and nbgrader:

![](jupyter.png)

# Problem 1

Load <b>Puerto Rico Given Names.txt</b>, calculate and return a DataFrame representing the top 5 number of occurrences of names and their corresponding years and names from 2010 to 2018 in descending order.

Hint:
groupby(by=['Year','Name'])

![](Assignment12.jpg)

In [22]:
import numpy as np
import pandas as pd

def myfunction():
    # YOUR CODE HERE
    df=pd.read_csv('Puerto Rico Given Names.txt')
    df=df[(df['Year']<=2018)&(df['Year']>=2010)]
    df=df.groupby(by=['Year','Name']).sum()
    df=df.sort_values(by='Number of occurrences',ascending=False).head(5)
    return df

In [27]:
import numpy as np
import pandas as pd

df=pd.read_csv('Puerto Rico Given Names.txt')
df=df[(df['Year']<=2018)&(df['Year']>=2010)]
df=df.groupby(by=['Year','Name']).sum()
df

              Number of occurrences
Year Name
2010 Aaliyah                      7
     Aaron                       23
     Abdel                        5
     Abdias                       6
     Abdiel                     130
...                             ...
2018 Zael                         5
     Zahid                       10
     Zahir                       15
     Zaid                        34
     Zoe                          8

[7832 rows x 1 columns]

In [23]:
res=myfunction()

assert res.shape==(5,1)
assert (res.values==np.array([[521],[511],[474],[466],[457]])).all()
assert res.loc[2010,'Luis']['Number of occurrences']==521
assert res.loc[2010,'Angel']['Number of occurrences']==511
assert res.loc[2014,'Sebastian']['Number of occurrences']==474
assert res.loc[2013,'Sebastian']['Number of occurrences']==466
assert res.loc[2016,'Sebastian']['Number of occurrences']==457
res

                Number of occurrences
Year Name
2010 Luis                         521
     Angel                        511
2014 Sebastian                    474
2013 Sebastian                    466
2016 Sebastian                    457